module.exports = {
  title: '设计模式与前端架构',
  path: '/知识库/设计模式与前端架构/',
  children: [
    {
      title: '设计模式',
      path: '/知识库/设计模式与前端架构/设计模式',
      children: [
        {
          title: '观察者模式',
          path: '/知识库/设计模式与前端架构/设计模式/观察者模式/',
          children: [
            {
              title: '观察者模式',
              path: '/知识库/设计模式与前端架构/设计模式/观察者模式/观察者模式',
            },
            {
              title: '发布订阅模式',
              path: '/知识库/设计模式与前端架构/设计模式/观察者模式/发布订阅模式',
            },
          ]
        },
      ],
    },
  ]
}